//
//  main.swift
//  03字符串和集合
//
//  Created by Li_JinLin on 2017/6/14.
//  Copyright © 2017年 www.dahuatech.com. All rights reserved.
//

import Foundation

print("Hello, World!-->字符串和集合")

/********************************************三、字符串和集合*************************************************/
//3.1 字符
//3.1.1字符概述
       //1 、在swift中，字符是字符串的基本组成单位，隶属于Character类型。字符只能是一个字母、数字、汉字或者符号，使用""包裹住；
       //2、字符定义的基本格式: let/var 名称:Character = "值"，let/var用于区分可变不可变
       //3、例: let ch:Character = "A" ,print(ch).使用"" 而不是C语言中的‘’
//3.1.2转义字符
       //1、不能直接使用"\"，因为\比较特殊，为转义字符;
       //2、常见的转义字符, \t : 水平制表符tab ，\n : 换行， \r : 回车   \" : 双引号    \' : 单引号   \\  ：反斜线
/*
    tip:swift语言采用Unicode编码，它的字符几乎涵盖了大家所知道的一切字符，包含图片表情
 */


//3.2字符串
//3.2.1初始化字符串

